SetOverwrite
Syntax
SapObject.SapModel.DesignAluminum.AA_2015.SetOverwrite
VB6 Procedure
Function SetOverwrite(ByVal Name As String, ByVal Item As Long, ByVal Value As Double, Optional ByVal ItemType As eItemType = Object) As Long
Parameters
Name
The name of an existing frame object or group, depending on the value of the ItemType item.
Item
This is an integer between 1 and 19, inclusive, indicating the overwrite item considered.
1 = Live load reduction factor
2 = Unbraced length ratio, Major
3 = Unbraced length ratio, Minor
4 = Unbraced length, Lateral Torsional Buckling (LTB)
5 = Effective length factor, K Major
6 = Effective length factor, K Minor
7 = Effective length factor, K LTB
8 = Bending coefficient, Cb
9 = Buckling constant for compression, k1
10 = Buckling constant for compression, k2
11 = Buckling constant for bending, k1
12 = Buckling constant for bending, k2
13 = Safety coefficient, kt
14 = Bending coefficient, C1
15 = Bending coefficient, C2
16 = Net area over gross area ratio
17 = Buckling constant, Ct
18 = Coordinate of load application, Za
19 = Demand/Capacity ratio limit
Value
The value of the considered overwrite item.
1 = Live load reduction factor
Value >= 0; 0 means use a program determined value.
2 = Unbraced length ratio, Major
Value >= 0; 0 means use program determined value.
3 = Unbraced length ratio, Minor
Value >= 0; 0 means use program determined value.
4 = Unbraced length ratio, Lateral Torsional Buckling
Value >= 0; 0 means use program determined value.
5 = Effective length factor, K Major
Value >= 0; 0 means use program determined value.
6 = Effective length factor, K Minor
Value >= 0; 0 means use program determined value.
7 = Effective length factor, K LTB
Value >= 0; 0 means use program determined value.
8 = Bending coefficient, Cb
Value >= 0; 0 means use program determined value.
9 = Buckling constant for compression, k1
Value >= 0; 0 means use program determined value.
10 = Buckling constant for compression, k2
Value >= 0; 0 means use program determined value.
11 = Buckling constant for bending, k1
Value >= 0; 0 means use program determined value.
12 = Buckling constant for bending, k2
Value >= 0; 0 means use program determined value.
13 = Safety coefficient, kt
Value >= 0; 0 means use program determined value.
14 = Bending coefficient, C1
Value >= 0; 0 means use program determined value.
15 = Bending coefficient, C2
Value >= 0; 0 means use program determined value.
16 = Net area over gross area ratio
Value >= 0; 0 means use program determined value.
17 = Buckling constant, Ct
Value >= 0; 0 means use program determined value.
18 = Coordinate of load application, Za
Value >= 0; 0 means use program determined value.
19 = Demand/capacity ratio limit
Value >= 0; 0 means use program determined value.
ItemType
This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
If this item is Object, the assignment is made to the frame object specified by the Name item.
If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
If this item is SelectedObjects, assignment is made to all selected frame objects, and the Name item is ignored.
Remarks
This function sets the value of an aluminum design overwrite item.
The function returns zero if the item is successfully set; otherwise it returns a nonzero value.
VBA Example
Sub SetAluminumDesignOverwriteItemAA_2015()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim Name As String
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'add aluminum material
 ret = SapModel.PropMaterial.AddQuick(Name, MATERIAL_ALUMINUM, , , MATERIAL_ALUMINUM_SUBTYPE_6061_T6)
 'create new aluminum frame section property
 ret = SapModel.PropFrame.SetISection("AI", Name , 18, 6, 0.5, 0.3, 6, 0.5)
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288, True, "AI", "AI")
 'set aluminum design code
 ret = SapModel.DesignAluminum.SetCode("AA 2015")
 'set overwrite item
 ret = SapModel.DesignAluminum.AA_2015.SetOverwrite("8", 1, 2)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 22.1.0
See Also
GetOverwrite